# Value Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyUInt64..::..Value Property
AssetPropertyUInt64 Class See Also
---
Get the value of the property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ulong Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As ULong
	Get
```

Visual C++
---
```text
public:
property unsigned long long Value {
	unsigned long long get ();
}
```

# See Also
AssetPropertyUInt64 Class
Autodesk.Revit.DB.Visual Namespace